{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "OpenAssistant/reward-model-deberta-v3-large",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.0,
  "modules_to_save": [
    "scores"
  ],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "query_proj",
    "value_proj"
  ],
  "task_type": "SEQ_CLS"
}